# Yosys script for synthesizing XOR.v
read_verilog C:\repositories\ProbabilisticComputing\Yosys\Sources\XOR.v
synth
abc -g AND,NAND,NOR,OR
write_json C:\repositories\ProbabilisticComputing\Yosys\Synthesized\XOR_synthesized.json