# script.ys
read_verilog Sources\Multiplier_3x3.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\Multiplier_3x3_synthesized.json