# Yosys script for synthesizing Multiplier_16x16=16.v
read_verilog C:\repositories\ProbabilisticComputing\Yosys\Sources\Multiplier_16x16=16.v
synth
abc -g AND,NAND,NOR,OR
write_json C:\repositories\ProbabilisticComputing\Yosys\Synthesized\Multiplier_16x16=16_synthesized.json