# script.ys
read_verilog Sources\Multiplier_verilog.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\Multiplier_verilog_synthesized.json