# script.ys
read_verilog Sources\Multiplier_32x32=64.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\Multiplier_32x32=64_synthesized.json
show -prefix Synthesized\Multiplier_32x32=64_synthesized.json