# Yosys script for synthesizing Multiplier_2x2=4.v
read_verilog C:\repositories\ProbabilisticComputing\Yosys\Sources\Multiplier_2x2=4.v
synth
abc -g AND,NAND,NOR,OR
write_json C:\repositories\ProbabilisticComputing\Yosys\Synthesized\Multiplier_2x2=4_synthesized.json
show -prefix Multiplier_2x2=4