# script.ys
read_verilog Sources\AND_gate.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\AND_gate_synthesized.json
show -prefix Synthesized\AND_gate_synthesized.json