# script.ys
read_verilog Sources\Multiplier_4x4=4.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\Multiplier_4x4=4_synthesized.json
show -prefix Sources\Multiplier_4x4=4.v top