# Yosys script for synthesizing Multiplier_8x8=8.v
read_verilog C:\repositories\ProbabilisticComputing\Yosys\Sources\Multiplier_8x8=8.v
synth
abc -g AND,NAND,NOR,OR
write_json C:\repositories\ProbabilisticComputing\Yosys\Synthesized\Multiplier_8x8=8_synthesized.json