# script.ys
read_verilog Sources\Multiplier_16x16=32.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\Multiplier_16x16=32_synthesized.json
show -prefix Synthesized\Multiplier_16x16=32_synthesized.json