# script.ys
read_verilog Sources\Multiplier_64x64=128.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\Multiplier_64x64=128_synthesized.json
show -prefix Synthesized\Multiplier_64x64=128_synthesized.json