# script.ys
read_verilog Sources\Multiplier_8x8=16.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\Multiplier_8x8=16_synthesized.json
show -prefix Synthesized\Multiplier_8x8=16_synthesized.json