# script.ys
read_verilog Sources\XOR.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\XOR_synthesized.json