# script.ys
read_verilog Sources\Multiplier_4x4=8.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\Multiplier_4x4=8_synthesized.json
show -prefix Synthesized\Multiplier_4x4=8_synthesized.json