# script.ys
read_verilog Sources\AND_AND_AND.v
synth
abc -g AND,NAND,NOR,OR
write_json Synthesized\AND_AND_AND_synthesized.json
show -prefix Synthesized\AND_AND_AND_synthesized.json